// 1. Выведите в консоль любую строку. Если выводимая строка пустая –
// отобразите строку текста по умолчанию.

var text = 'Lorem ipsum dolor sit.';
console.log(text);

// 2. Создайте любой объект, например, "браузер" и выведите в консоль все
// его поля.






// 3. Дополнительно к п.2: создайте метод для объекта.
// 4. Сделайте цикл for от 1 до 20 и выведите в консоль только четные
// значения.
// 5. Создайте любой код, используя конструкцию switch / case / default.
// 6. Создайте условие, используя тернарный оператор ?.
// 7. Выводите значение переменной, пока не достигнуто значение 7
// (используйте цикл while).
// 8. Создайте основную функцию, которая принимает три параметра:
// ○ первые два параметра – числа 2 (число, арг1) и 4 (степень, арг2)
// ○ третий параметр – callback, возвратная функция
// В основной функции выведите сообщение: "Число арг1 в степени арг2".
// Затем выполните возведение числа в степень, результат присвойте
// переменной.
// Передайте переменную в возвратную функцию (арг3), где сгенерируйте
// сообщение: "Результат арг3".
